---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseA
source: html/35b66d8e-eafe-f6ba-1d11-4bcac26c2ea8.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentLoadPhaseA Property

The ApparentLoadPhaseA value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentLoadPhaseA { get; }
```

## Remarks
This property is used to retrieve the ApparentLoadPhaseA value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!